class EventDay < ActiveHash::Base
  self.data = [
    { id: 1, name: '--' }, { id: 2, name: 'キュン：個握 4月7日（日）大阪：大阪ATCホール' }, 
    { id: 3, name: 'キュン：全握 4月30日（火・祝）千葉：幕張メッセ' },{ id: 4, name: 'キュン：個握 5月6日（月・祝）千葉：幕張メッセ' }, 
    { id: 5, name: 'キュン：全握 5月12日（日）愛知：ポートメッセなごや' }, { id: 6, name: 'キュン：個握 6月8日（土）千葉：幕張メッセ' },
    { id: 7, name: 'キュン：全握 6月22日（土）京都：京都パルスプラザ' }, { id: 8, name: 'キュン：個握 6月30日（日）東京：東京ビッグサイト' }, 
    { id: 9, name: 'キュン：個握 7月21日（日）東京：東京流通センター' }, { id: 10, name: 'キュン：個握 8月11日（日）愛知：吹上ホール' }, 
    { id: 11, name: 'ドレミ：全握 8月17日(土)京都：京都パルスプラザ' }, { id: 12, name: 'ドレミ：個握 8月24日(土)神奈川：パシフィコ横浜' },
    { id: 13, name: 'ドレミ：個握 8月31日(土)神奈川：パシフィコ横浜' }, { id: 14, name: 'ドレミ：個握 9月14日(土)愛知：Aichi Sky Expo' }, 
    { id: 15, name: 'ドレミ：全握 9月16日(月・祝)千葉：幕張メッセ' }, { id: 16, name: 'ドレミ：全握 9月22日(日)愛知：Aichi Sky Expo' }, 
    { id: 17, name: 'ドレミ：個握 9月29日(日)京都：京都パルスプラザ' }, { id: 18, name: 'ドレミ：個握 10月13日(日)神奈川：パシフィコ横浜' },
    { id: 19, name: 'ドレミ：個握 10月22日(火・祝)東京：東京流通センター' }, { id: 20, name: 'こん好き：全握 10月19日（土）千葉・幕張メッセ' }, 
    { id: 21, name: 'こん好き：全握 11月3日（日）京都・京都パルスプラザ' }, { id: 22, name: 'こん好き：個握 11月24日（日）神奈川・パシフィコ横浜' }, 
    { id: 23, name: 'こん好き：全握 12月15日（日）愛知・Aichi sky expo（愛知県国際展示場）' }, { id: 24, name: 'こん好き：個握 1月18日（土）愛知・ポートメッセなごや' },
    { id: 25, name: 'こん好き：個握 1月19日（日）京都・パルスプラザ' }, { id: 26, name: 'こん好き：個握 2月2日（日）東京・東京ビッグクサイト' },
    { id: 27, name: 'ミートアンドグリート' } 
  ]
end